     A*------------------------------------------------------------------------*
     A*N FILE NAME - APPWACN                                                   *
     A*------------------------------------------------------------------------*
     A*P COPYRIGHT MINCRON SBC CORP. 1983,1990,2006.                           *
     A*------------------------------------------------------------------------*
     A*D ACH CSV NOTIFICATION WORK FILE                                        *
     A*M ----------------------------------------------------------------------*
     A*M TASK       DATE   ID  DESCRIPTION                                     *
     A*M ---------- ------ --- ------------------------------------------------*
     A*M ----------------------------------------------------------------------*
     A          R AVATAXR
     A            TRANSDATE       L
     A                                      COLHDG('Date')
     A                                      ALIAS(MYDATE)
     A            REGION         2
     A                                      COLHDG('Region')
     A                                      ALIAS(MYREGION)
     A            ID            40
     A                                      COLHDG('ID')
     A                                      ALIAS(MYID)
