     A*%%TS  SD  20260324  210000  SYSTEM      REL-V7R5M0  5770-WDS
     A*------------------------------------------------------------------------*
     A*N FILE NAME - LISTPRBKD                                                 *
     A*------------------------------------------------------------------------*
     A*P                                                                       *
     A*------------------------------------------------------------------------*
     A*D PRICE BOOK ITEM LISTING WITH OMIT CAPABILITY                          *
     A*M ----------------------------------------------------------------------*
     A*M TASK       DATE   ID  DESCRIPTION                                     *
     A*M ---------- ------ --- ------------------------------------------------*
     A*V 1.0        032426 SYS CREATION OF DISPLAY                             *
     A*M ----------------------------------------------------------------------*
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      CHGINPDFT(UL)
     A                                      INDARA
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      CF13
     A                                      CF14
     A                                      CF15
     A                                      CF16
     A                                      CF17
     A                                      CF18
     A                                      CF19
     A                                      CF20
     A                                      CF21
     A                                      CF22
     A                                      CF23
     A                                      CF24
     A N33                                  PAGEDOWN
     A                                      PAGEUP
     A                                      PRINT
     A*=============================================================
     A*  Subfile for price book items
     A*=============================================================
     A          R SUB01                     SFL
     A*%%TS  SD  20260324  210000  SYSTEM      REL-V7R5M0  5770-WDS
     A                                      SFLNXTCHG
     A            S1OPT          1A  B 10  2
     A            S1ITEM         6A  O 10  5
     A            S1PROD        15A  O 10 13
     A            S1DESC        30A  O 10 29
     A            S1SECT         3A  O 10 61
     A            S1GRP          3A  O 10 66
     A            S1CAT          3A  O 10 71
     A            S1OMIT         6A  O 10 76COLOR(RED)
     A*=============================================================
     A*  Control for subfile
     A*=============================================================
     A          R SUB01CTL                  SFLCTL(SUB01)
     A*%%TS  SD  20260324  210000  SYSTEM      REL-V7R5M0  5770-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0012)
     A                                      RTNCSRLOC(&#REC &#FLD)
     A                                      OVERLAY
     A                                      SFLCSRRRN(&WHERE)
     A  31                                  SFLDSP
     A  32                                  SFLDSPCTL
     A  30                                  SFLCLR
     A  33                                  SFLEND(*MORE)
     A            SCRRN          4S 0H      SFLRCDNBR
     A            #REC          10A  H
     A            #FLD          10A  H
     A            WHERE          5S 0H
     A            COMPANY        3S 0H
     A            BRANCH         3S 0H
     A            CUSTOMER       6S 0H
     A            USERID        10A  H
     A*
     A* Positioning Fields (line 9 - above column headers)
     A            POSITEM        6A  B  9  5COLOR(WHT) CHANGE(50)
     A            POSPROD       15A  B  9 13COLOR(WHT) CHANGE(51)
     A            POSDESC       30A  B  9 29COLOR(WHT) CHANGE(52)
     A            POSSECT        3A  B  9 61COLOR(WHT) CHANGE(53)
     A            POSGRP         3A  B  9 66COLOR(WHT) CHANGE(54)
     A            POSCAT         3A  B  9 71COLOR(WHT) CHANGE(55)
     A*
     A* Header Information
     A                                  1  3DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A            C1TITLE       40A  O  1 47DSPATR(HI)
     A                                  2  3TIME
     A                                      COLOR(BLU)
     A            C1DISPLAY     40A  O  2 47COLOR(BLU)
     A            C1FORMAT      10A  O  3  3COLOR(PNK)
     A*
     A* Parameter Display
     A                                  3 50'Company:'
     A                                      COLOR(BLU)
     A            DSPCOMP        3S 0O  3 59
     A                                      COLOR(BLU)
     A                                  3 65'Branch:'
     A                                      COLOR(BLU)
     A            DSPBRNCH       3S 0O  3 73
     A                                      COLOR(BLU)
     A                                  3 79'Customer:'
     A                                      COLOR(BLU)
     A            DSPCUST        6S 0O  3 89
     A                                      COLOR(BLU)
     A                                  3 98'User:'
     A                                      COLOR(BLU)
     A            DSPUSER       10A  O  3104COLOR(BLU)
     A*
     A* Instructions
     A                                  4  3'Type options, press Enter.'
     A                                      COLOR(BLU)
     A                                  5  4'1=Omit Item   4=Remove Omit'
     A                                      COLOR(BLU)
     A*
     A* Column Headers
     A                                  8  1'Op'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8  5'Item'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 13'Product'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 29'Item Description'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 61'Sec'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 66'Grp'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 71'Cat'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  8 76'Status'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A*=========================================================================
     A* Footer record format
     A*=========================================================================
     A          R FOOTER
     A*%%TS  SD  20260324  210000  SYSTEM      REL-V7R5M0  5770-WDS
     A                                 23  2'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 12'F7=Omit All'
     A                                      COLOR(BLU)
     A                                 23 26'F8=Remove All'
     A                                      COLOR(BLU)
     A N60                             23 43'F9=Show All'
     A N60                                  COLOR(BLU)
     A  60                             23 43'F9=Excluded Only'
     A  60                                  COLOR(BLU)
     A                                 23 65'F12=Cancel'
     A                                      COLOR(BLU)
     A*=========================================================================
     A* Message subfile
     A*=========================================================================
     A          R MSGSFL                    SFL
     A                                      SFLMSGRCD(23)
     A            MSGKEY                    SFLMSGKEY
     A            PGMQ                      SFLPGMQ(10)
     A*=========================================================================
     A* Message subfile control
     A*=========================================================================
     A          R MSGCTL                    SFLCTL(MSGSFL)
     A*%%TS  SD  20260324  210000  SYSTEM      REL-V7R5M0  5770-WDS
     A                                      OVERLAY
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A                                      SFLINZ
     A N03                                  SFLEND
     A                                      SFLSIZ(0002)
     A                                      SFLPAG(0001)
     A            PGMQ                      SFLPGMQ(10)
