     A*------------------------------------------------------------------------*
     A*N FILE NAME - SIGNON                                                    *
     A*------------------------------------------------------------------------*
     A*P COPYRIGHT MINCRON SBC CORP. 1983,1990,2006.                           *
     A*------------------------------------------------------------------------*
     A*D HARDGOODS DISTRIBUTION MAIN MENU                                      *
     A*M ----------------------------------------------------------------------*
     A*M TASK       DATE   ID  DESCRIPTION                                     *
     A*M ---------- ------ --- ------------------------------------------------*
     A*V 8000011000 013006 000 MINCRON MSS/HD RELEASE 11.0                     *
CD   A*E 8000009901 041806 019 CHANGE TO GET VERSIONS FROM DATA AREAS          *
CJ CNA*E 8000010168 071607 016 +NOTE+ CURRENT SIGNON SCREEN - "HD11.0C  PROD"  *
CK   A*E 8000010199 110507 920 INTELLIGENT MESSAGING                           *
CN   A*E 8000010420 052808 016 +NOTE+ CURRENT SIGNON SCREEN - "HD11.0D  PROD"  *
CN   A*E 8000010420 052808 016 ADD VERSION VALUE FOR WKVERSION                 *
CO   A*E 8000010455 070908 016 REMOVE WKVERSION FRM SIGNON HD-LIBS             *
CV   A*E 8000011764 061614 275 ADD COMLINK WARNING                             *
%S   A*E 8000011867 120614 200 Change DSPSIZ keyword
C3   A*E 8000012526 121916 019 Replace Mincron Logo w/Corporate Info page      *
C5   A*E 8000012714 100917 019 Replace Mincron text w/Kerridge Commercial Sys  *
¢A   A*E 6496       062216 CLP ADDED PRINTER TROUBLESHOOTING OPTION 20         *
¢B   A*E 8032 KSB   030818 KSB ADD CLARITY INV REQ OPTION 21                   *
     A*M ----------------------------------------------------------------------*
   %SA*                                     DSPSIZ(24 80 *DS3)
%S   A                                      DSPSIZ(*DS3 *DS4)
     A                                      CF03(03 'Return to Initial Menu')
     A                                      PRINT
   %AA*                                     HELP(25 'HELP TEXT')
   %AA*                                     CF01(25 'HELP TEXT')
%A   A                                      CF01(25 'HELP')
     A          R MAIN
     A                                  1  2'MAIN'
     A                                      COLOR(BLU)
     A                                  1 26'Hardgoods Distribution System'
     A                                      DSPATR(HI)
     A            OPTION         2Y 0H
     A            FPATH          9A  H
     A            CMDLIN         9A  I 21  7
     A  90                                  ERRMSG('Option not available.' 90)
     A  92                                  ERRMSG('Fast Path not available.' -
     A                                       92)
     A  91                                  ERRMSG('Warehouse Management is not-
     A                                       installed.' 91)
CN COA*           HDVSN         13     22 67
CN COA*                                     COLOR(RED)
   CDA*                                23  2'Proprietary Software -- All Righ-
   CDA*                                     ts Reserved By Mincron SBC Corporat-
   CDA*                                     ion.'
   CDA*                                     DSPATR(HI)
CD C5A*                                23  1'Proprietary Software--All Rights R-
CD C5A*                                     eserved By Mincron SBC Corp.'
C5   A                                 23  1'Proprietary - All Rights-
C5   A                                       reserved by Kerridge Commercial Sy-
C5   A                                      stems'
CD   A                                      DSPATR(HI)
CD CNA*           HDVSN         13     23 67
CN COA*           SHVSN         13     23 67
CO   A            HDVSN         13     23 67
CD   A                                      COLOR(RED)
   CDA*                                24  2'NOT FOR REPRODUCTION, Except As -
   CDA*                                     Provided For In License Agreement'
   CDA*                                     DSPATR(HI)
CD   A                                 24  1'NOT FOR REPRODUCTION, Except As -
CD   A                                      Provided For In License Agreement'
CD   A                                      DSPATR(HI)
   CDA*                                24 72'V1R11M0 '
CD CNA*           SHVSN         13     24 67
CN COA*           WKVSN         13     24 67
CO   A            SHVSN         13     24 67
     A                                      COLOR(RED)
     A                                  3  2'Select one of the following:'
     A                                      COLOR(BLU)
     A                                  4  7'1. Order processing'
¢A   A                                  4 45'20. Troubleshoot Printer Issue'
¢B   A                                  5 45'21. Inventory Review Request'
     A                                  5  7'2. Inventory control'
     A                                  6  7'3. Accounts receivable'
     A                                  7  7'4. Sales analysis'
     A                                  8  7'5. Purchasing'
     A                                  9  7'6. General ledger'
     A                                 10  7'7. Accounts payable'
     A                                 11  7'8. Pricing'
     A                                 12  7'9. Inventory management'
     A                                 13  6'10. Transfers'
     A                                 14  6'11. Truck routing'
     A                                 15  6'12. Receiving'
     A                                 16  6'13. Operations'
     A                                 17  6'14. Warehouse management'
     A                                 18  6'90. Signoff'
CK   A  61        NEWMQ          3  0   3 55EDTCDE(4)
CK   A  51                                  COLOR(RED)
CK   A  52                                  COLOR(BLU)
CK   A  53                                  COLOR(WHT)
CK   A  61        NEWM          20      3 59
CK   A  51                                  COLOR(RED)
CK   A  52                                  COLOR(BLU)
CK   A  53                                  COLOR(WHT)
CK   A  62        NEWUQ          3  0   4 55EDTCDE(4)
CK   A  51                                  COLOR(RED)
CK   A  52                                  COLOR(BLU)
CK   A  53                                  COLOR(WHT)
CK   A  62        NEWU          20      4 59
CK   A  51                                  COLOR(RED)
CK   A  52                                  COLOR(BLU)
CK   A  53                                  COLOR(WHT)
CK   A  63        NEWTQ          3  0   5 55EDTCDE(4)
CK   A  51                                  COLOR(RED)
CK   A  52                                  COLOR(BLU)
CK   A  53                                  COLOR(WHT)
CK   A  63        NEWT          20      5 59
CK   A  51                                  COLOR(RED)
CK   A  52                                  COLOR(BLU)
CK   A  53                                  COLOR(WHT)
     A                                 20  2'Selection or Fast Path'
     A                                 21  2'===>'
   C3A*         R GREETING
   C3A*                                     CLEAR
   C3A*                                     BLINK
   C3A*                                 2 27'W  E  L  C  O  M  E    T  O'
   C3A*                                     DSPATR(HI)
   C3A*                                 4 39'.:.'
   C3A*                                     COLOR(GRN)
   C3A*                                 5 37'.: '' :.'
   C3A*                                     COLOR(GRN)
   C3A*                                 6 35'.: . '' . :.'
   C3A*                                     COLOR(GRN)
   C3A*                                 7 33'.:  .  .  .  :.'
   C3A*                                     COLOR(GRN)
   C3A*                                 8 31'.: . . . . . . . :.'
   C3A*                                     COLOR(GRN)
   C3A*                                 9 29'.: .. . .. . .. . .. :.'
   C3A*                                     COLOR(GRN)
   C3A*                                10 27'.:.. . . .. . . .. . . ..:.'
   C3A*                                     COLOR(GRN)
   C3A*                                11 25'.:::.:.:.:.::..:..::.:.:.:.:::.'
   C3A*                                     COLOR(GRN)
   C3A*                                12 25''':::.::.::.:.::.::.:.::.::.:::'''
   C3A*                                     COLOR(GRN)
   C3A*                                13 27''':::.::.:::.:.:.:::.::.:::'''
   C3A*                                     COLOR(GRN)
   C3A*                                14 29''':::.::.:::.:::.::.:::'''
   C3A*                                     COLOR(GRN)
   C3A*                                15 31''':::::.::.::.:::::'''
   C3A*                                     COLOR(GRN)
   C3A*                                16 33'''::::::.::::::'''
   C3A*                                     COLOR(GRN)
   C3A*                                17 35''':::::::::'''
   C3A*                                     COLOR(GRN)
   C3A*                                18 37''':::::'''
   C3A*                                     COLOR(GRN)
   C3A*                                19 39''':'''
   C3A*                                     COLOR(GRN)
   C3A*                                21 25'M    I    N    C    R    O    N'
   C3A*                                     DSPATR(HI)
   C3A*                                23 25'S o f t w a r e   S y s t e m s'
   C3A*                                     DSPATR(HI)
C3   A          R GREETING
C3   A                                      CLEAR
C3   A                                      BLINK
C3 C5A*                                 2  7'MINCRON SOFTWARE SYSTEMS'
C5   A                                  2  7'KERRIDGE COMMERCIAL SYSTEMS'
C3   A                                      COLOR(PNK)
C3   A                                  3  7'__________________________________-
C3   A                                      ___________________________________-
C3   A                                      ___'
C3   A                                      COLOR(PNK)
C3 C5A*                                 5  7'Houston, Texas, USA - Mincron Head-
C3 C5A*                                     quarters'
C5   A                                  5  7'Houston, Texas, USA'
C3   A                                      COLOR(WHT)
C3   A                                  7  8'Address:'
C3   A                                      COLOR(BLU)
C3   A                                  8  9'333 North Sam Houston Parkway East'
C3   A                                      COLOR(BLU)
C3   A                                  9  9'Suite 1100'
C3   A                                      COLOR(BLU)
C3   A                                 10  9'Houston, TX 77060'
C3   A                                      COLOR(BLU)
C3 C5A*                                11 46'Mincron Software Systems'
C3 C5A*                                     COLOR(PNK)
C3   A                                 12  8'Sales & Customer Support'
C3   A                                      COLOR(BLU)
C3 C5A*                                12 50'is a member of'
C3 C5A*                                     COLOR(PNK)
C3   A                                 13  9'Tel: 800.299.7010'
C3   A                                      COLOR(BLU)
C3   A                                 13 42'Kerridge Commercial Systems Group'
C3   A                                      COLOR(PNK)
C3   A                                 15  8'Corporate Offices'
C3   A                                      COLOR(BLU)
C3   A                                 15 43'Providers of fully integrated'
C3   A                                      COLOR(WHT)
C3   A                                 16  9'Tel: 281.999.7010'
C3   A                                      COLOR(BLU)
C3   A                                 16 42'software and services focused on'
C3   A                                      COLOR(WHT)
C3   A                                 17 42'the Distributive Trades industry.'
C3   A                                      COLOR(WHT)
C3   A                                 18  8'Email'
C3   A                                      COLOR(BLU)
C3 C5A*                                19  9'Info@mincron.com'
C5   A                                 19  9'Info@kerridgecsna.com'
C3   A                                      COLOR(BLU)
C3   A                                 19 39'Source Effectively, Stock Efficien-
C3   A                                      tly,'
C3   A                                      COLOR(PNK)
C3   A                                 20 39'Sell Profitably, Service Competiti-
C3   A                                      vely'
C3   A                                      COLOR(PNK)
C3   A                                 22  7'__________________________________-
C3   A                                      ___________________________________-
C3   A                                      ___'
C3   A                                      COLOR(PNK)
CV   A          R COMLNKWRN
CV   A                                      WINDOW(8 9 7 60 *NOMSGLIN)
CV   A                                  1  1'SIGNON'
CV   A                                      COLOR(BLU)
CV   A                                  1 23'ComLink Warning'
CV   A                                      DSPATR(HI)
CV   A                                  3  2'Signing into this session has disa-
CV   A                                      bled ComLink in '
CV   A                                  4  2'SmartDistributor, meaning you must-
CV   A                                       manage your messages '
CV   A                                  5  2'from this session.'
CV   A                                  7  2'Would you like to re-enable -
CV   A                                      ComLink?'
CV   A            YORN           1   B  7 39VALUES('Y' 'N')
CV   A                                  7 41'(Y/N)'
